Revit 2025 API
VerticalAlignmentStyle Enumeration
 Declares the vertical alignment style of font.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum VerticalAlignmentStyle
Public Enumeration VerticalAlignmentStyle
public enum class VerticalAlignmentStyle
type VerticalAlignmentStyle
Members
Member name | Value | Description
Top | 0 |  Alignment to top
Middle | 4 |  Alignment to middle
Bottom | 8 |  Alignment to bottom
See Also
Reference
Autodesk.Revit.DB Namespace